app/controllers/front_controller.rb

SELECT * FROM "portfolios"
---
  def index
    @portfolios = Portfolio.find(:all)
=begin
    @portfolios.each do |portfolio|