app/controllers/portfolios_controller.rb

  def show

    @portfolio = find_instance
    totVal = @portfolio.updateVals #important
---
UPDATE "portfolios" SET "updated_at" = '2011-04-12 09:30:07', "value" = 310837.0 WHERE "id" = 1